In [1]:
import pandas as pd

In [4]:
nomes_masculinos = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_femininos = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

In [5]:
print(f"Quantidade de Nomes: {len(nomes_femininos) + len(nomes_masculinos)}")

Quantidade de Nomes: 400

In [6]:
frames = [nomes_femininos, nomes_masculinos]

In [8]:
nomes = pd.concat(frames)['nome'].to_frame()

In [9]:
nomes.sample(5)

        nome
41   DANIELA
185  JONATAN
1       JOAO
186     ERIC
1        ANA

In [10]:
#Incluindo ID dos Alunos

In [11]:
import numpy as np
np.random.seed(123)

In [12]:
total_alunos = len(nomes)

In [13]:
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1

In [14]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [18]:
dominios = ['@dominio.com.br', '@servico.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [19]:
nomes.sample(5)

         nome  id_aluno          dominio
190  NATANAEL        58     @servico.com
104  REINALDO        28     @servico.com
193  LUCILENE       146     @servico.com
98      THAIS       148  @dominio.com.br
2     ANTONIO       205  @dominio.com.br

In [20]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [21]:
nomes.sample(5)

        nome  id_aluno          dominio                   email
101   SILVIO       363     @servico.com      silvio@servico.com
71     MARTA       265     @servico.com       marta@servico.com
137  AUGUSTO       376  @dominio.com.br  augusto@dominio.com.br
15     BRUNO       293  @dominio.com.br    bruno@dominio.com.br
163  REGIANE       308  @dominio.com.br  regiane@dominio.com.br